module.exports = {
    name: "rules",
    alias: ["grouprules", "rul", "rule"],
    category: "Group",
    desc: "গ্রুপের রুলস দেখানোর জন্য",

    exec: async (bad, m, { prefix }) => {
        const rulesText = `╭─ 〔📜✨ 𝗚𝗿𝗼𝘂𝗽 𝗥𝘂𝗹𝗲𝘀 ✨📜〕─╮

𝟏 | 🚫 𝗣ermission 𝗰𝗵𝗮𝗿𝗮 𝗺𝗲𝘆𝗲𝗱𝗲𝗿 𝗸𝗲 𝗱𝗶𝘀𝘁𝘂𝗿𝗯 → 𝗥𝗲𝗺𝗼𝘃𝗲 𝗵𝗼𝗯𝗲

𝟐 | 👻 𝗣𝗮𝗿𝘀𝗼𝗻𝗮𝗹 𝗸𝗼𝘁𝗵𝗮 𝗯𝗼𝗹𝘁𝗲 𝗰𝗵𝗮𝗶𝗹𝗲 𝗮𝗴𝗲 𝗴𝗿𝗼𝘂𝗽 𝗲 𝗺𝗲𝗻𝘁𝗶𝗼𝗻 𝗸𝗼𝗿𝘂𝗻 

𝟑 | ❌ 𝗞𝗵𝗮𝗿𝗮𝗽 𝗯𝗵𝗮𝘀𝗵𝗮 → 𝗥𝗲𝗺𝗼𝘃𝗲 𝗵𝗼𝗯𝗲

𝟒 | 🌸 𝗡𝗼𝘁𝘂𝗻 𝗺𝗲𝗺𝗯𝗲𝗿 𝗲𝗹𝗲 𝘁𝗮𝗸𝗲 𝗥𝘂𝗹𝗲𝘀 𝗽𝗼𝗿𝗲 𝗱𝗶𝘁𝗲 𝗵𝗼𝗯𝗲

𝟓 | 🪷 𝗦𝗼𝗯𝗮𝗶 𝗺𝗶𝗹𝗲 𝗪𝗲𝗹𝗰𝗼𝗺𝗲 𝗷𝗮𝗻𝗮𝗯𝗲𝗻

𝟔 | 🥂 𝟑/𝟒 𝗱𝗶𝗻 𝗶𝗻𝗮𝗰𝘁𝗶𝘃𝗲 𝗵𝗼𝗹𝗲 𝗥𝗲𝗺𝗼𝘃𝗲 (𝗝𝗼𝗿𝘂𝗿𝗶 𝗵𝗼𝗹𝗲 𝗔𝗱𝗺𝗶𝗻 𝗸𝗲 𝗯𝗼𝗹𝘂𝗻)

𝟕 | 🚫 𝗞𝗵𝗮𝗿𝗮𝗽 𝗰𝗵𝗼𝗯𝗶 / 𝗜𝘀𝗹𝗶𝘁 → 𝗞𝗶𝗰𝗸

𝟖 | 🚫 𝗢𝗻𝗻𝗼 𝗴𝗿𝗼𝘂𝗽 𝗹𝗶𝗻𝗸 → 𝗞𝗶𝗰𝗸  

𝟗 | ⛔ 𝗣𝗿𝗼𝗺𝗼𝘁𝗲 → 𝗥𝗲𝗺𝗼𝘃𝗲

𝟏𝟎 | BTS/Argentina/Brazil Niye Kotha Bola jabe na 

𝟏𝟏 | ⚠️ 𝗔𝗱𝗺𝗶𝗻 𝗽𝗮𝗿𝗺𝗶𝘀𝗵𝗼𝗻 𝗰𝗵𝗮𝗿𝗮 𝘃𝗶𝗱𝗲𝗼 𝗯𝗮𝗻𝗮𝗻𝗼 𝗷𝗮𝗯𝗲 𝗻𝗮

𝟏𝟐 | 😊🌸 𝗦𝗼𝗯𝗮𝗶 𝗳𝗿𝗶𝗲𝗻𝗱𝗹𝘆 𝗯𝗵𝗮𝗯𝗲 𝗸𝗼𝘁𝗵𝗮 𝗯𝗼𝗹𝘂𝗻

𝟏𝟑 | 🚫 𝗞𝗮𝘂𝗸𝗲 𝗛𝘂𝗿𝘁 / 𝗢𝗽𝗼𝗺𝗮𝗻 → 𝗞𝗶𝗰𝗸

𝟏𝟒 | 🚫 𝗞𝗵𝗮𝗿𝗮𝗽 𝗦𝘁𝗶𝗰𝗸𝗲𝗿 → 𝗞𝗶𝗰𝗸

𝟏𝟓 | 🚫 𝗢𝗻𝗻𝗼 𝗦𝗼𝗰𝗶𝗮𝗹 𝗹𝗶𝗻𝗸 (𝗬𝗧/𝗙𝗕/𝗜𝗻𝘀𝘁𝗮) → 𝗞𝗶𝗰𝗸

╰─ ✅ 𝗣𝗹𝗲𝗮𝘀𝗲 𝗥𝘂𝗹𝗲𝘀 𝗙𝗼𝗹𝗹𝗼𝘄 ✅─╯

╭─ 〔💖 𝗧𝗵𝗮𝗻𝗸 𝗬𝗼𝘂 💖〕─╮
😊 𝗦𝗼𝗯𝗮𝗶 𝗥𝘂𝗹𝗲𝘀 𝗺𝗲𝗻𝗲 𝗰𝗵𝗼𝗹𝘂𝗻
 𝗘𝗻𝗷𝗼𝘆 𝗧𝗵𝗲 𝗚𝗿𝗼𝘂𝗽 & 𝗦𝗽𝗿𝗲𝗮𝗱 𝗟𝗼𝘃𝗲💝

*
           > *ᴘᴏᴡᴇʀᴇᴅ ʙʏ ꜰᴀʜɪᴍ ʙʙᴢ*`;

        try {
            await bad.sendMessage(m.chat, { react: { text: '📜', key: m.key } });
            return await bad.sendMessage(m.chat, { text: rulesText }, { quoted: m });
        } catch (error) {
            console.error("Rules Command Error:", error);
        }
    }
};
